---
kind: method
id: M:Autodesk.Revit.DB.Architecture.TopographySurface.AsSiteSubRegion
source: html/cc8e617b-fe4e-08a2-9347-cfc44e9f1abe.htm
---
# Autodesk.Revit.DB.Architecture.TopographySurface.AsSiteSubRegion Method

Obtains the subregion object represented by this element.

## Syntax (C#)
```csharp
public SiteSubRegion AsSiteSubRegion()
```

## Returns
The SiteSubRegion element. If this does not represent a SiteSubRegion, this will be Nothing nullptr a null reference ( Nothing in Visual Basic) .

## Remarks
This applies to TopographySurface and SiteSubRegion elements.